"""
封装工具类
1、上传后台类
2、mysql类
3、监测标题重复
4、返回省市的编号
5、获取代理ip
"""
# <nofiltera></nofiltera> 这个标签仅仅保留a链接里边的href属性，不加的话后台是默认删除
# <nofilter></nofilter> 加入这个标签可以去除js当文本显示，保持原来代码完整
# ["rar", "zip", "doc", "docx", "xls", "ppt", "dwg", "pdf", "pptx", "jpg", "jpeg", "gif", "png", "bmp", "7z", "wps", "zbs", "swf", "fyzf", "gz", "bz2", "hfcf", "hfzf","CSGCZF"]
# ["中标", "成交", "结果", "合同", "废标", "流标"]

import requests
import time,datetime
import json
import random
import threading
from hashlib import md5

ips = []
lock = threading.Lock()

# 时间自动生成
today = datetime.date.today()
yesterday = today - datetime.timedelta(days=1)
yesterday_1 = today - datetime.timedelta(days=2)
today_str =today.strftime('%Y-%m-%d')
yesterday_str =yesterday.strftime('%Y-%m-%d')
yesterday_1_str =yesterday_1.strftime('%Y-%m-%d')

headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36",
    "Cookie": "__jsluid_h=52d15d62259b2eacdb97ee6b798f5b6a; client_login_info=787bgZWVwnq_wxO2Th_pCtIw8JZIFcW.shxjslodYzXD2GAJi8dKEdDGQlsAaWZw779QdM1.ciOzy56I; clientlogin=fc1bMkLYGP1VIHhlLSNmWICTI3w8sH6VGFWW73v6WYFbqL5984czsOGX.rp3CnNCOD9otWnVVp9tq_Fkiy46HiBiiECwfFTv9Reb49YIhQdeFv4b; Hm_lvt_2bcf2125a6023661c7c71e9111ae9d53=1574936150,1575008143,1575079864,1575343234; Qs_lvt_278260=1574816307%2C1574936150%2C1575008143%2C1575079862%2C1575343233; Qs_pv_278260=3893670450121527000%2C3952495039439689000%2C2970218440000754700%2C2416788784359911000%2C307773907429302900; PHPSESSID=ee5i07935j4ibp9c5vq8n45ivm; userlogin=6ea4.iNW83gMcAsetZN3r7eSPAlzRKxMJUB3CzWuvBgqt2z7st16FQbRF5Iy3pDWKqJD5usr5tKeV66na_NbaF06gkIMMB_RJV51VErTnCx3XtwzHx2dLjpogfvjAMySXL.RhVF5QdBXRpc; login_info=6ea4.iNW83gMcAsetcEg_.eaMQwtEKpMdEsjDDiuvhhY9Gzks8FjEnSTFI8z3pDLIvUZ5A",
}


class Save():
    """
    保存类
    利用requests来post保存数据
    需要输入参数：
    标题，招标编号,所属分类,所属行业,招标状况,省,市,来源（跟编号一样）,内容,时间,是否显示,排序（非必须）,点击次数（非必须）,附件(非必须)
    """
    def __init__(self,h_title,h_code,h_infoid,h_industry,h_condition,h_province,h_city,h_source,h_content,h_time,h_status,h_sort=None,h_hits=None,h_file=None, info_url=None):
        self.h_title = h_title.replace(" ", '')  # 标题
        self.h_code = h_code    # 招标编号
        self.h_infoid = h_infoid    # 所属分类
        self.h_industry = h_industry    # 所属行业
        self.h_condition = h_condition  # 招标状况
        self.h_province = h_province    # 省
        self.h_city = h_city    # 市
        self.h_source = h_source    # 来源（跟编号一样）
        self.h_content = h_content  # 内容
        self.h_time = h_time    # 时间
        self.h_status = h_status    # 是否显示
        self.h_sort = h_sort    # 排序
        self.h_hits = h_hits    # 点击次数
        self.h_file = h_file   # 附件
        self.info_url = info_url  # 原文链接

    def save_backstaget(self):
        '''存储到后台'''
        try:
            form_data = {
                "title" : self.h_title,
                "code" : self.h_code,
                "infoid" : self.h_infoid,
                "industry" : self.h_industry,
                "condition" : self.h_condition,
                "province" : self.h_province,
                "city" : self.h_city,
                "source" : self.h_source,
                "content" : self.h_content,
                "time" : self.h_time,
                "status" : self.h_status,
                "sort" : self.h_sort,
                "hits" : self.h_hits,
                "attach[]":"(binary)",
                "info_url": self.info_url
            }
            headers = {
                "User-Agent":"Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36",
                "Cookie":"__jsluid_h=52d15d62259b2eacdb97ee6b798f5b6a; client_login_info=8843bQSJyiGuCGPrUPpFyXGc25FfZ40z_W9i6fo5TGEORV_ARhsQR2g2jtSbRIuC7DLOuo4f5tqeJFNc; Qs_lvt_278260=1573097846%2C1573202288%2C1573261336%2C1574652463%2C1574750265; Hm_lvt_2bcf2125a6023661c7c71e9111ae9d53=1573202289,1573261336,1574652463,1574750266; Qs_pv_278260=1478957393390035000%2C3577115608761176000%2C3577090809620020700%2C3842390138359000600%2C3245184262649779000; PHPSESSID=0lhdj92lr8nbg9h6534ka5g3h9; userlogin=6893zAPtj7Dxp93pzWBXdo7AJOtiaw6Cdy.jnC_vErpe2ICQdVR34OTmGi35wZ5YCX5IRY40JJg2fX_YM7j6ar1Mx87DjE.NJgKI7z_L_Wmo1moOdBn_277mwJqSwZeBj43ZAp1ry2r.KDw; login_info=6893zAPtj7Dxp93pzWUJdduZdeJpZVjWcXrzlCnvELosm4CPdEhu55akGTD4wZ4QCHQfHetye4s8cX.JbuT4ObtJnJjCjkTUJm7JvTjA_W2qgG9YJR2Sn7g"
            }
            # 去重
            title_sta =Data_deduplication(self.h_title, self.h_province, self.h_time).post()
            if title_sta:
                print("再次查重数据重复")
            else:
                print("新数据，开始上传")
                # 通过时间戳拼接上传后台url
                tt = time.time()
                post_backstagr_url = "http://ad13in.gc-zb.com/infomation/news_add.html?tt={}{}".format(tt, '0')
                # 请求网页,上传网页
                print("开始上传")
                proxies = {"https": "223.91.79.184"}
                html = requests.post(url=post_backstagr_url,data=form_data,headers=headers,files=self.h_file, proxies=proxies)
                if html.status_code == 200:
                    print("上传成功")
                time.sleep(1.5)
        except Exception as E:
            print("标题为：{} 的上传失败".format(self.h_title))
            print("错误信息：", E)


class Data_deduplication():
    """
    //检测标题重复
    /*
    "title":"标题",#只检索标题，不检索全文
    "province":"省",#参照后台发布参数，，0代表所有省，-1或空字符串 代表没有省，
    "city":"市",#参照后台发布参数，0代表所有市，-1或空字符串代表没有市
    "infoid":"所属分类"#参照后台发布参数，例如，9代表招标，11代表中标
    "time":"时间"#参照后台发布参数，例如，2019-04-11

    返回值为符合条件的信息,信息包括，
    招标编号    所属分类    招标名称    所属行业    地区(省，市)   发布时间   发布人  招标情况
    均为后台发布时上传的参数 例如中标，返回11
    */
    http://ad13in.gc-zb.com/publiccon/select_tit
    """
    def __init__(self,h_title,h_province=0,h_time=today, h_infoid=None):
        """参数为标题、省，自动从后台查重"""
        self.h_title = h_title
        self.h_province = h_province
        self.h_time = h_time
        self.h_infoid = h_infoid

    def post(self):
        try:
            url = "http://ad13in.gc-zb.com/publiccon/select_tit"
            headers = {
                "User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36",
                "Cookie": "__jsluid_h=52d15d62259b2eacdb97ee6b798f5b6a; client_login_info=787bgZWVwnq_wxO2Th_pCtIw8JZIFcW.shxjslodYzXD2GAJi8dKEdDGQlsAaWZw779QdM1.ciOzy56I; clientlogin=fc1bMkLYGP1VIHhlLSNmWICTI3w8sH6VGFWW73v6WYFbqL5984czsOGX.rp3CnNCOD9otWnVVp9tq_Fkiy46HiBiiECwfFTv9Reb49YIhQdeFv4b; Hm_lvt_2bcf2125a6023661c7c71e9111ae9d53=1574936150,1575008143,1575079864,1575343234; Qs_lvt_278260=1574816307%2C1574936150%2C1575008143%2C1575079862%2C1575343233; Qs_pv_278260=3893670450121527000%2C3952495039439689000%2C2970218440000754700%2C2416788784359911000%2C307773907429302900; PHPSESSID=ee5i07935j4ibp9c5vq8n45ivm; userlogin=6ea4.iNW83gMcAsetZN3r7eSPAlzRKxMJUB3CzWuvBgqt2z7st16FQbRF5Iy3pDWKqJD5usr5tKeV66na_NbaF06gkIMMB_RJV51VErTnCx3XtwzHx2dLjpogfvjAMySXL.RhVF5QdBXRpc; login_info=6ea4.iNW83gMcAsetcEg_.eaMQwtEKpMdEsjDDiuvhhY9Gzks8FjEnSTFI8z3pDLIvUZ5A",
            }
            data = {
                "title": self.h_title,
                "province":self.h_province,
                "time": self.h_time,
                "infoid": self.h_infoid,
            }
            response = requests.post(url=url, headers=headers, data=data, timeout=20)
            html = response.content.decode('utf-8')
            h_body = json.loads(html)
            msg = h_body['msg']
            if msg == "找到了数据":
                # 已经存在数据返回True
                return True
            else:
                # 没有存在数据返回False
                return False
        except Exception as e:
            print("程序错误；错误信息：", e)


class GetIpThread(threading.Thread):
    """获取代理IP的线程类"""
    def __init__(self,fetchSecond=5):
        super(GetIpThread, self).__init__()
        self.fetchSecond=fetchSecond

    def get_ip(self):
        global ips
        # 这里填写无忧代理IP提供的API订单号（请到用户中心获取）
        order = "82ab3f5e87a7b4ff8d0ccef660023811"
        # 获取IP的API接口
        apiUrl = "http://api.ip.data5u.com/dynamic/get.html?order=eca7dd2adb671600906edd2590fed7cf&random=1&sep=3"
        # 获取IP列表
        try:
            lock.acquire()
            time.sleep(0.4)
            res = requests.get(apiUrl, timeout=10).content.decode()
        finally:
            lock.release()
        # 按照\n分割获取到的IP
        ips = res.split('\n')
        # 利用每一个IP
        for proxyip in ips:
            if proxyip.strip():
                proxies = {"http": 'http://' + proxyip, "https": 'https://' + proxyip}
                if proxies == {'http': 'http://too many requests', 'https': 'https://too many requests'}:
                    time.sleep(random.random()/10)
                    self.get_ip()
                else:
                    return proxies


class Get_num():
    """获取上传的城市跟编号"""
    def __init__(self, province=None, city=None, xian=None):
        self.province = province
        self.city = city
        self.xian = xian
        # 各个省对应的编号
        self.province_to_value = {
            '安徽': '1', '北京': '19', '广东': '21',
            '上海': '43', '天津': '45', '重庆': '47',
            '辽宁': '49', '江苏': '64', '湖北': '79',
            '四川': '97', '陕西': '119', '河北': '130',
            '山西': '142', '河南': '154', '吉林': '173',
            '黑龙江': '183', '内蒙古': '197', '山东': '210',
            '浙江': '228', '福建': '244', '湖南': '254',
            '广西': '270', '江西': '285', '贵州': '297',
            '云南': '310', '西藏': '332', '海南': '340',
            '甘肃': '359', '宁夏': '374', '青海': '380',
            '新疆': '389', '香港': '405', '台湾': '407',
            '澳门': '416',
        }
        # 各个城市对应的编号
        self.city_to_value = {
            '亳州': '18', '池州': '17', '巢湖': '16', '六安': '15', '宣城': '14', '铜陵': '13',
            '淮北': '12', '黄山': '11', '阜阳': '10', '宿州': '9', '安庆': '8', '马鞍山': '7',
            '淮南': '6', '滁州': '5', '蚌埠': '4', '芜湖': '3', '合肥': '2', '北京': '20',
            '东莞': '42', '潮州': '41', '云浮': '40', '清远': '39', '河源': '38', '中山': '37',
            '湛江': '36', '肇庆': '35', '佛山': '34', '珠海': '33', '深圳': '32', '汕头': '31',
            '梅州': '30', '惠州': '29', '韶关': '28', '江门': '27', '茂名': '26', '揭阳': '25',
            '阳江': '24', '汕尾': '23', '广州': '22', '上海': '44', '天津': '46', '重庆': '48',
            '葫芦岛': '63', '盘锦': '62', '朝阳': '61', '辽阳': '60', '阜新': '59', '营口': '58',
            '锦州': '57', '丹东': '56', '本溪': '55', '抚顺': '54', '鞍山': '53', '大连': '52',
            '铁岭': '51', '沈阳': '50', '宿迁': '78', '泰州': '77', '常熟': '76', '常州': '75',
            '连云港': '74', '淮安': '73', '徐州': '72', '盐城': '71', '扬州': '70', '南通': '69',
            '苏州': '68', '镇江': '67', '无锡': '66', '南京': '65','神农架林': '96', '潜江': '95',
            '天门': '94', '仙桃': '93', '荆门': '92', '随州': '91', '十堰': '90', '恩施': '89',
            '宜昌': '88', '荆州': '87', '咸宁': '86', '黄石': '85', '黄冈': '84', '孝感': '83',
            '鄂州': '82', '襄阳': '81', '武汉': '80', '凉山州': '118', '阿坝州': '117', '眉山': '116',
            '内江': '115', '广元': '114', '德阳': '113', '甘孜州': '112', '雅安': '111', '乐山': '110',
            '资阳': '109', '宜宾': '108', '泸州': '107', '巴中': '106', '广安': '105','遂宁': '104',
            '达州': '103', '南充': '102', '绵阳': '101', '自贡': '100', '攀枝花': '99', '成都': '98',
            '铜川': '129', '宝鸡': '128', '汉中': '127', '安康': '126', '商洛': '125', '渭南': '124',
            '榆林': '123', '延安': '122', '咸阳': '121', '西安': '120','秦皇岛': '141', '邢台': '140',
            '衡水': '139', '沧州': '138', '廊坊': '137', '唐山': '136', '承德': '135', '张家口': '134',
            '保定': '133', '石家庄': '132', '邯郸': '131', '运城': '153', '吕梁': '152', '临汾': '151',
            '晋城': '150', '长治': '149', '晋中': '148', '阳泉': '147', '大同': '146', '太原': '145',
            '忻州': '144', '朔州': '143', '济源': '172', '三门峡': '171', '驻马店': '170', '漯河': '169',
            '周口': '168', '濮阳': '167', '鹤壁': '166', '焦作': '165', '洛阳': '164', '开封': '163',
            '南阳': '162', '信阳': '161', '平顶山': '160', '许昌': '159', '新乡': '158', '安阳': '157',
            '郑州': '156', '商丘': '155', '白山': '182', '松原': '181', '辽源': '180', '白城': '179',
            '通化': '178', '四平': '177', '延边自治州': '176', '吉林': '175', '长春': '174', '大兴安岭': '196',
            '双鸭山': '195', '鹤岗': '194', '鸡西': '193', '七台河': '192', '大庆': '191', '伊春': '190',
            '黑河': '189', '绥化': '188', '佳木斯': '187', '牡丹江': '186', '齐齐哈尔': '185', '哈尔滨': '184',
            '乌海': '209', '阿拉善盟': '208', '兴安盟': '207', '锡林郭勒盟': '206', '巴彦淖尔': '205', '鄂尔多斯': '204',
            '赤峰': '203', '通辽': '202', '乌兰察布': '201', '包头': '200', '呼和浩特': '199', '呼伦贝尔': '198',
            '聊城': '227', '日照': '225', '枣庄': '224', '威海': '223', '东营': '222', '滨州': '221',
            '临沂': '220', '泰安': '219', '济宁': '218', '潍坊': '217', '烟台': '216', '德州': '215',
            '淄博': '214', '青岛': '213', '济南': '212', '菏泽': '211', '龙岩': '251', '瑞安': '242',
            '嵊州': '241', '上虞': '240', '舟山': '239', '金华': '238', '丽水': '237', '温州': '236',
            '台州': '235', '绍兴': '234', '宁波': '233', '嘉兴': '232', '湖州': '231', '杭州': '230',
            '衢州': '229', '南平': '253', '三明': '252', '漳州': '250', '泉州': '249', '莆田': '248',
            '宁德': '247', '厦门': '246', '福州': '245', '湘西自治州': '269', '永州': '268', '怀化': '267',
            '张家界': '266', '湘西': '265', '邵阳': '264', '娄底': '263', '益阳': '262', '常德': '261',
            '郴州': '260', '衡阳': '259', '株洲': '258', '湘潭': '257', '长沙': '256', '岳阳': '255',
            '崇左': '284', '来宾': '283', '贺州': '282', '贵港': '281','北海': '280', '河池': '279',
            '钦州': '278', '百色': '277', '玉林': '276', '梧州': '275', '桂林': '274', '柳州': '273',
            '南宁': '272', '防城港': '271', '萍乡': '296', '景德镇': '295', '赣州': '294', '吉安': '293',
            '宜春': '292', '抚州': '291', '上饶': '290', '九江': '289', '南昌': '288', '新余': '287',
            '鹰潭': '286', '黔南': '309', '黔东': '308', '黔西': '307', '兴义': '306', '六盘水': '305',
            '毕节': '304', '铜仁': '303', '凯里': '302', '都匀': '301', '安顺': '300', '遵义': '299',
            '贵阳': '298', '普洱市': '419', '迪庆州': '331', '怒江州': '330', '德宏州': '329', '大理州': '328',
            '楚雄州': '327', '西双': '326', '红河州': '325', '丽江': '324', '中甸': '323', '临沧': '322',
            '思茅': '321', '楚雄': '320', '玉溪': '319', '文山': '318', '保山': '317', '曲靖': '316',
            '大理': '315', '昆明': '314', '昭通': '313', '德宏': '312', '西双版纳': '311', '阿里': '339',
            '那曲': '338', '昌都': '337', '林芝': '336', '山南': '335', '日喀则': '334', '拉萨': '333',
            '琼中': '358', '保亭': '357', '陵水': '356', '乐东': '355', '昌江': '354', '白沙': '353',
            '临高': '352', '屯昌': '351', '澄迈': '350', '东方': '349', '文昌': '348', '琼海': '347',
            '五指山': '346', '万宁': '345', '定安': '344', '三亚': '343', '海口': '342', '儋州': '341',
            '甘南州': '373', '武威': '372', '嘉峪关': '371', '白银': '370', '陇南': '369', '天水': '368',
            '酒泉': '367', '张掖': '366', '金昌': '365', '庆阳': '364', '平凉': '363', '定西': '362',
            '兰州': '361', '临夏': '360', '中卫': '379', '固原': '378', '吴忠': '377', '石嘴山': '376',
            '银川': '375', '海西州': '388', '玉树州': '387', '果洛州': '386', '海南州': '385', '黄南州': '384',
            '海北州': '383', '海东': '382', '西宁': '381', '伊犁': '404', '喀什': '403', '阿克苏': '402',
            '巴音郭楞': '401', '吐鲁番': '400', '昌吉州': '399', '石河子': '398', '乌鲁木齐': '397', '克拉玛依': '396',
            '博尔塔拉': '395', '克孜勒苏': '394', '阿勒泰': '393', '和田': '392', '哈密': '391', '塔城': '390',
            '香港': '406', '花莲': '415', '新竹': '414', '嘉义': '413', '台南': '412', '台中': '411',
            '基隆': '410', '高雄': '409', "台北": '408', '澳门': '417'}
        # 省对应的市
        self.province_to_city={
            '安徽': ['亳州', '池州', '巢湖', '六安', '宣城', '铜陵', '淮北', '黄山', '阜阳', '宿州', '安庆', '马鞍山', '淮南', '滁州', '蚌埠', '芜湖', '合肥'],
            '北京': ['北京'],
            '广东': ['东莞', '潮州', '云浮', '清远', '河源', '中山', '湛江', '肇庆', '佛山', '珠海', '深圳', '汕头', '梅州', '惠州', '韶关', '江门', '茂名', '揭阳', '阳江', '汕尾', '广州'],
            '上海': ['上海'],
            '天津': ['天津'],
            '重庆': ['重庆'],
            '辽宁': ['葫芦岛', '盘锦', '朝阳', '辽阳', '阜新', '营口', '锦州', '丹东', '本溪', '抚顺', '鞍山', '大连', '铁岭', '沈阳'],
            '江苏': ['宿迁', '泰州', '常熟', '常州', '连云港', '淮安', '徐州', '盐城', '扬州', '南通', '苏州', '镇江', '无锡', '南京'],
            '湖北': ['神农架林', '潜江', '天门', '仙桃', '荆门', '随州', '十堰', '恩施', '宜昌', '荆州', '咸宁', '黄石', '黄冈', '孝感', '鄂州', '襄阳', '武汉'],
            '四川': ['凉山州', '阿坝州', '眉山', '内江', '广元', '德阳','甘孜州', '雅安', '乐山', '资阳', '宜宾', '泸州', '巴中', '广安', '遂宁', '达州', '南充', '绵阳', '自贡', '攀枝花', '成都'],
            '陕西': ['铜川', '宝鸡', '汉中', '安康', '商洛', '渭南', '榆林', '延安', '咸阳', '西安'],
            '河北': ['秦皇岛', '邢台', '衡水', '沧州', '廊坊', '唐山', '承德', '张家口', '保定', '石家庄', '邯郸'],
            '山西': ['运城', '吕梁', '临汾', '晋城', '长治', '晋中', '阳泉', '大同', '太原', '忻州', '朔州'],
            '河南': ['济源', '三门峡', '驻马店', '漯河', '周口', '濮阳', '鹤壁', '焦作', '洛阳', '开封', '南阳', '信阳', '平顶山', '许昌', '新乡', '安阳', '郑州', '商丘'],
            '吉林': ['白山', '松原', '辽源', '白城', '通化', '四平', '延边自治州', '吉林', '长春'],
            '黑龙江': ['大兴安岭', '双鸭山', '鹤岗', '鸡西', '七台河', '大庆', '伊春', '黑河', '绥化', '佳木斯', '牡丹江', '齐齐哈尔', '哈尔滨'],
            '内蒙古': ['乌海', '阿拉善盟', '兴安盟', '锡林郭勒盟', '巴彦淖尔', '鄂尔多斯', '赤峰', '通辽', '乌兰察布', '包头', '呼和浩特', '呼伦贝尔'],
            '山东': ['聊城', '日照', '枣庄', '威海', '东营', '滨州', '临沂', '泰安', '济宁', '潍坊', '烟台', '德州', '淄博', '青岛', '济南', '菏泽'],
            '浙江': ['龙岩', '瑞安', '嵊州', '上虞', '舟山', '金华', '丽水', '温州', '台州', '绍兴', '宁波', '嘉兴', '湖州', '杭州', '衢州'],
            '福建': ['南平', '三明', '龙岩', '漳州', '泉州', '莆田', '宁德', '厦门', '福州'],
            '湖南': ['湘西自治州', '永州', '怀化', '张家界', '湘西', '邵阳', '娄底', '益阳', '常德', '郴州', '衡阳', '株洲','湘潭', '长沙', '岳阳'],
            '广西': ['崇左', '来宾', '贺州', '贵港', '北海', '河池', '钦州', '百色', '玉林', '梧州', '桂林','柳州', '南宁', '防城港'],
            '江西': ['萍乡', '景德镇', '赣州', '吉安', '宜春', '抚州', '上饶', '九江', '南昌', '新余', '鹰潭'],
            '贵州': ['黔南', '黔东', '黔西', '兴义', '六盘水', '毕节', '铜仁', '凯里', '都匀', '安顺', '遵义', '贵阳'],
            '云南': ['普洱市','迪庆州', '怒江州', '德宏州', '大理州', '楚雄州', '西双', '红河州', '丽江', '中甸', '临沧', '思茅', '楚雄', '玉溪', '文山','保山', '曲靖', '大理', '昆明', '昭通', '德宏', '西双版纳'],
            '西藏': ['阿里', '那曲', '昌都', '林芝', '山南', '日喀则', '拉萨'],
            '海南': ['琼中', '保亭', '陵水', '乐东', '昌江', '白沙', '临高', '屯昌', '澄迈', '东方', '文昌', '琼海', '五指山', '万宁','定安', '三亚', '海口', '儋州'],
            '甘肃': ['甘南州', '武威', '嘉峪关', '白银', '陇南', '天水', '酒泉', '张掖', '金昌', '庆阳', '平凉', '定西', '兰州', '临夏'],
            '宁夏': ['中卫', '固原', '吴忠', '石嘴山', '银川'],
            '青海': ['海西州', '玉树州', '果洛州', '海南州', '黄南州', '海北州', '海东', '西宁'],
            '新疆': ['伊犁', '喀什', '阿克苏', '巴音郭楞', '吐鲁番', '昌吉州', '石河子','乌鲁木齐', '克拉玛依', '博尔塔拉', '克孜勒苏', '阿勒泰', '和田', '哈密', '塔城'],
            '香港': ['香港'],
            '台湾': ['花莲', '新竹', '嘉义', '台南', '台中', '基隆', '高雄', '台北'],
            '澳门': ['澳门']
        }
        # 市对应的县或者地区
        self.city_to_xian={
            '花莲': [],
            '基隆': [],
            '台北': [],
            '台南': [],
            '嘉义': [],
            '台中': [],
            '高雄': [],
            '乌鲁木齐': ['天山区', '沙依巴克区', '新市区', '水磨沟区', '头屯河区', '达坂城区', '米东区', '乌鲁木齐县'],
            '克拉玛依': ['独山子区', '克拉玛依区', '白碱滩区', '乌尔禾区'],
            '吐鲁番': ['高昌区', '鄯善县', '托克逊县'],
            '哈密': ['伊州区', '巴里坤县', '伊吾县'],
            '昌吉州': ['昌吉市', '阜康市', '呼图壁县', '玛纳斯县', '奇台县', '吉木萨尔县', '木垒哈萨克自治县'],
            '博尔塔拉': ['博乐市', '阿拉山口市', '精河县', '温泉县'],
            '巴音郭楞': ['库尔勒市', '轮台县', '尉犁县', '若羌县', '且末县', '焉耆回族自治县', '和静县', '和硕县', '博湖县'],
            '阿克苏': ['阿克苏市', '温宿县', '库车县', '沙雅县', '新和县', '拜城县', '乌什县', '阿瓦提县', '柯坪县'],
            '克孜勒苏': ['阿图什市', '阿克陶', '阿合奇县', '乌恰县'],
            '喀什': ['喀什市', '疏附县', '疏勒县', '英吉沙县', '泽普县', '莎车县', '叶城县', '麦盖提县', '岳普湖县', '伽师县', '巴楚县', '塔什库尔干塔吉克县'],
            '和田': ['和田市', '和田县', '墨玉县', '皮山县', '洛浦县', '策勒县', '于田县', '民丰县'],
            '伊犁': ['伊宁市', '奎屯市', '霍尔果斯市', '伊宁县', '察布县', '霍城县', '巩留县', '新源县', '昭苏县', '特克斯县', '尼勒克县'],
            '塔城': ['塔城市', '乌苏市', '额敏县', '沙湾县', '托里县', '裕民县', '和布克赛尔县'],
            '阿勒泰': ['阿勒泰市', '布尔津县', '富蕴县', '福海县', '哈巴河县', '青河县', '吉木乃县'],
            '石河子': ['新城街道', '向阳街道', '红山街道', '老街街道', '东城街道', '北泉镇', '石河子镇', '兵团一五二团'],
            '银川': ['兴庆区', '西夏区', '金凤区', '永宁县', '贺兰县', '灵武市'],
            '石嘴山': ['大武口区', '惠农区', '平罗县'],
            '吴忠': ['利通区', '红寺堡区', '盐池县', '同心县', '青铜峡市'],
            '固原': ['原州区', '西吉县', '隆德县', '泾源县', '彭阳县'],
            '中卫': ['沙坡头区', '中宁县', '海原县'],
            '西宁': ['大通县', '湟中县', '湟源县'],
            '海东': ['乐都区', '平安区', '民和县', '互助土族自治县', '化隆回族自治县', '循化撒拉族自治县'],
            '海北州': ['门源回族自治县', '祁连县', '海晏县', '刚察县'],
            '黄南州': ['同仁县', '尖扎县', '泽库县', '河南蒙古族自治县'],
            '海南州': ['共和县', '同德县', '贵德县', '兴海县', '贵南县'],
            '果洛州': ['玛沁县', '班玛县', '甘德县', '达日县', '久治县', '玛多县'],
            '玉树州': ['玉树市', '杂多县', '称多县', '治多县', '囊谦县', '曲麻莱县'],
            '海西州': ['格尔木市', '德令哈市', '乌兰县', '都兰县', '天峻县'],
            '兰州': ['城关区', '七里河区', '西固区', '安宁区', '红古区', '永登县', '皋兰县', '榆中县', '兰州新区'],
            '嘉峪关': ['新城镇', '峪泉镇', '文殊镇', '雄关区', '镜铁区', '长城区'],
            '金昌': ['金川区', '永昌县'],
            '白银': ['白银区', '平川区', '靖远县', '会宁县', '景泰县'],
            '天水': ['秦州区', '麦积区', '清水县', '秦安县', '甘谷县', '武山县', '张家川回族自治县'],
            '武威': ['凉州区', '民勤县', '古浪县', '天祝藏族自治县'],
            '张掖': ['甘州区', '肃南县', '民乐县', '临泽县', '高台县', '山丹县'],
            '平凉': ['崆峒区', '泾川县', '灵台县', '崇信县', '华亭市', '庄浪县', '静宁县'],
            '酒泉': ['肃州区', '金塔县', '瓜州县', '肃北县', '阿克塞县', '玉门市', '敦煌市'],
            '庆阳': ['西峰区', '庆城县', '环县', '华池县', '合水县', '正宁县', '宁县', '镇原县'],
            '定西': ['安定区', '通渭县', '陇西县', '渭源县', '临洮县', '漳县', '岷县'],
            '陇南': ['武都区', '成县', '文县', '宕昌县', '康县', '西和县', '礼县', '徽县', '两当县'],
            '临夏': ['临夏市', '临夏县', '康乐县', '永靖县', '广河县', '和政县', '东乡族自治县', '积石山县'],
            '甘南州': ['合作市', '临潭县', '卓尼县', '舟曲县', '迭部县', '玛曲县', '碌曲县', '夏河县'],
            '西安': ['新城区', '碑林区', '莲湖区', '灞桥区', '未央区', '雁塔区', '阎良区', '临潼区', '长安区', '高陵区', '邑区', '蓝田县', '周至县'],
            '铜川': ['王益区', '印台区', '耀州区', '宜君县'],
            '宝鸡': ['渭滨区', '金台区', '陈仓区', '凤翔县', '岐山县', '扶风县', '眉县', '陇县', '千阳县', '麟游县', '凤县', '太白县'],
            '咸阳': ['秦都区', '杨陵区', '渭城区', '三原县', '泾阳县', '乾县', '礼泉县', '永寿县', '彬县', '长武县', '旬邑县', '淳化县', '武功县', '兴平市'],
            '渭南': ['临渭区', '潼关县', '华州区', '大荔县', '合阳县', '澄城县', '蒲城县', '白水县', '富平县', '韩城市', '华阴市'],
            '延安': ['宝塔区', '安塞区', '延长县', '延川县', '子长县', '志丹县', '吴起县', '甘泉县', '富县', '洛川县', '宜川县', '黄龙县', '黄陵县'],
            '汉中': ['汉台区', '南郑区', '城固县', '洋县', '西乡县', '勉县', '宁强县', '略阳县', '镇巴县', '留坝县', '佛坪县'],
            '榆林': ['榆阳区', '横山区', '府谷县', '靖边县', '定边县', '绥德县', '米脂县', '佳县', '吴堡县', '清涧县', '子洲县', '神木市'],
            '安康': ['汉滨区', '汉阴县', '石泉县', '宁陕县', '紫阳县', '岚皋县', '平利县', '镇坪县', '旬阳县', '白河县'],
            '商洛': ['商州区', '洛南县', '丹凤县', '商南县', '山阳县', '镇安县', '柞水县'],
            '拉萨': ['城关区', '堆龙德庆区', '达孜区', '林周县', '当雄县', '尼木县', '曲水县', '墨竹工卡县'],
            '日喀则': ['桑珠孜区', '南木林县', '江孜县', '定日县', '萨迦县', '拉孜县', '昂仁县', '谢通门县', '白朗县', '仁布县', '康马县', '定结县', '仲巴县', '亚东县', '吉隆县', '聂拉木县', '萨嘎县', '岗巴县'],
            '昌都': ['卡若区', '江达县', '贡觉县', '类乌齐县', '丁青县', '察雅县', '八宿县', '左贡县', '芒康县', '洛隆县', '边坝县'],
            '林芝': ['巴宜区', '工布江达县', '米林县', '墨脱县', '波密县', '察隅县', '朗县'],
            '山南': ['乃东区', '扎囊县', '贡嘎县', '桑日县', '琼结县', '曲松县', '措美县', '洛扎县', '加查县', '隆子县', '错那县', '浪卡子县'],
            '那曲': ['色尼区', '嘉黎县', '比如县', '聂荣县', '安多县', '申扎县', '索县', '班戈县', '巴青县', '尼玛县', '双湖县'],
            '阿里': ['普兰县', '札达县', '噶尔县', '日土县', '革吉县', '改则县', '措勤县'],
            '昆明': ['五华区', '盘龙区', '官渡区', '西山区', '东川区', '呈贡区', '晋宁区', '富民县', '宜良县', '石林彝族自治县', '嵩明县', '禄劝县', '寻甸县', '安宁市'],
            '曲靖': ['麒麟区', '沾益区', '马龙区', '陆良县', '师宗县', '罗平县', '富源县', '会泽县', '宣威市'],
            '玉溪': ['红塔区', '江川区', '澄江县', '通海县', '华宁县', '易门县', '峨山县', '新平县', '元江县'],
            '保山': ['隆阳区', '施甸县', '龙陵县', '昌宁县', '腾冲市'],
            '昭通': ['昭阳区', '鲁甸县', '巧家县', '盐津县', '大关县', '永善县', '绥江县', '镇雄县', '彝良县', '威信县', '水富县'],
            '丽江': ['古城区', '玉龙县', '永胜县', '华坪县', '宁蒗县'],
            '普洱市': ['思茅区', '宁洱县', '墨江县', '景东县', '景谷县', '镇沅县', '江城县', '孟连县', '澜沧县', '西盟县'],
            '临沧': ['临翔区', '凤庆县', '云县', '永德县', '镇康县', '双江县', '耿马县', '沧源县'],
            '楚雄州': ['楚雄市', '双柏县', '牟定县', '南华县', '姚安县', '大姚县', '永仁县', '元谋县', '武定县', '禄丰县'],
            '红河州': ['个旧市', '开远市', '蒙自市', '屏边县', '建水县', '石屏县', '弥勒市', '泸西县', '元阳县', '红河县', '金平县', '绿春县', '河口县'],
            '文山': ['文山市', '砚山县', '西畴县', '麻栗坡县', '马关县', '丘北县', '广南县', '富宁县'],
            '西双版纳': ['景洪市', '勐海县', '勐腊县'],
            '大理州': ['大理市', '漾濞县', '祥云县', '宾川县', '弥渡县', '南涧县', '巍山县', '永平县', '云龙县', '洱源县', '剑川县', '鹤庆县'],
            '德宏州': ['瑞丽市', '芒市', '梁河县', '盈江县', '陇川县'],
            '怒江州': ['泸水市', '福贡县', '贡山县', '兰坪县'],
            '迪庆州': ['香格里拉市', '德钦县', '维西傈僳族自治县'],
            '贵阳': ['南明区', '云岩区', '花溪区', '乌当区', '白云区', '观山湖区', '开阳县', '息烽县', '修文县', '清镇市'],
            '六盘水': ['钟山区', '六枝特区', '水城县', '盘州市'],
            '遵义': ['红花岗区', '汇川区', '播州区', '桐梓县', '绥阳县', '正安县', '道真县', '务川县', '凤冈县', '湄潭县', '余庆县', '习水县', '赤水市', '仁怀市'],
            '安顺': ['西秀区', '平坝区', '普定县', '镇宁县', '关岭县', '紫云县'],
            '毕节': ['七星关区', '大方县', '黔西县', '金沙县', '织金县', '纳雍县', '威宁县', '赫章县'],
            '铜仁': ['碧江区', '万山区', '江口县', '玉屏县', '石阡县', '思南县', '印江县', '德江县', '沿河县', '松桃县'],
            '黔西': ['兴义市', '兴仁市', '普安县', '晴隆县', '贞丰县', '望谟县', '册亨县', '安龙县'],
            '黔东': ['镇远县', '凯里市', '黄平县', '施秉县', '三穗县', '岑巩县', '天柱县', '锦屏县', '剑河县', '台江县', '黎平县', '榕江县', '从江县', '雷山县', '麻江县', '丹寨县'],
            '黔南': ['都匀市', '福泉市', '荔波县', '贵定县', '瓮安县', '独山县', '平塘县', '罗甸县', '长顺县', '龙里县', '惠水县', '三都县'],
            '成都': ['锦江区', '青羊区', '金牛区', '武侯区', '成华区', '龙泉驿区', '青白江区', '新都区', '温江区', '双流区', '郫都区', '金堂县', '大邑县', '蒲江县', '新津县', '都江堰市', '彭州市', '邛崃市', '崇州市', '简阳市'],
            '自贡': ['自流井区', '贡井区', '大安区', '沿滩区', '荣县', '富顺县'],
            '攀枝花': [ '仁和区', '米易县', '盐边县'],
            '泸州': ['江阳区', '纳溪区', '龙马潭区', '泸县', '合江县', '叙永县', '古蔺县'],
            '德阳': ['旌阳区', '罗江区', '中江县', '广汉市', '什邡市', '绵竹市'],
            '绵阳': ['涪城区', '游仙区', '安州区', '三台县', '盐亭县', '梓潼县', '北川县', '平武县', '江油市'],
            '广元': ['利州区', '昭化区', '朝天区', '旺苍县', '青川县', '剑阁县', '苍溪县'],
            '遂宁': ['船山区', '安居区', '蓬溪县', '射洪县', '大英县'],
            '内江': [ '东兴区', '威远县', '资中县', '经济开发区', '隆昌市'],
            '乐山': [ '沙湾区', '五通桥区', '金口河区', '犍为县', '井研县', '夹江县', '沐川县', '峨边彝族自治县', '马边彝族自治县', '峨眉山市'],
            '南充': ['顺庆区', '高坪区', '嘉陵区', '南部县', '营山县', '蓬安县', '仪陇县', '西充县', '阆中市'],
            '眉山': ['东坡区', '彭山区', '仁寿县', '洪雅县', '丹棱县', '青神县'],
            '宜宾': ['翠屏区', '南溪区', '叙州区', '江安县', '长宁县', '高县', '珙县', '筠连县', '兴文县', '屏山县'],
            '广安': ['广安区', '前锋区', '岳池县', '武胜县', '邻水县', '华蓥市'],
            '达州': ['通川区', '达川区', '宣汉县', '开江县', '大竹县', '渠县', '经济开发区', '万源市'],
            '雅安': ['雨城区', '名山区', '荥经县', '汉源县', '石棉县', '天全县', '芦山县', '宝兴县'],
            '巴中': ['巴州区', '恩阳区', '通江县', '南江县', '平昌县', '经济开发区'],
            '资阳': ['雁江区', '安岳县', '乐至县'],
            '阿坝州': ['马尔康市', '汶川县', '理县', '茂县', '松潘县', '九寨沟县', '金川县', '小金县', '黑水县', '壤塘县', '阿坝县', '若尔盖县', '红原县'],
           '甘孜州': ['康定市', '泸定县', '丹巴县', '九龙县', '雅江县', '道孚县', '炉霍县', '甘孜县', '新龙县', '德格县', '白玉县', '石渠县', '色达县', '理塘县', '巴塘县', '乡城县', '稻城县', '得荣县'],
            '凉山州': ['西昌市', '木里县', '盐源县', '德昌县', '会理县', '会东县', '宁南县', '普格县', '布拖县', '金阳县', '昭觉县', '喜德县', '冕宁县', '越西县', '甘洛县', '美姑县', '雷波县'],
            '海口': ['秀英区', '龙华区', '琼山区', '美兰区'],
            '三亚': ['海棠区', '吉阳区', '天涯区', '崖州区'],
            '五指山': ['通什镇', '南圣镇', '毛阳镇', '番阳镇', '畅好乡', '毛道乡', '水满乡'],
            '琼海': ['嘉积镇', '万泉镇', '大路镇', '石壁镇', '中原镇', '博鳌镇', '阳江镇', '龙江镇', '潭门镇', '塔洋镇', '长坡镇', '会山镇'],
            '儋州': ['那大镇', '和庆镇', '南丰镇', '大成镇', '雅星镇', '兰洋镇', '光村镇', '木棠镇', '海头镇', '峨蔓镇', '三都镇', '王五镇', '白马井镇', '中和镇', '排浦镇', '东成镇', '新州镇'],
            '文昌': ['文城镇', '重兴镇', '蓬莱镇', '会文镇', '东路镇', '潭牛镇', '东阁镇', '文教镇', '东郊镇', '龙楼镇', '昌洒镇', '翁田镇', '抱罗镇', '冯坡镇', '锦山镇', '铺前镇', '公坡镇'],
            '万宁': ['国营新中农场村', '万城镇', '龙滚镇', '和乐镇', '后安镇', '大茂镇', '东澳镇', '礼纪镇', '长丰镇', '山根镇', '北大镇', '南桥镇', '三更罗镇', '国营东兴农场', '国营东和农场', '兴隆华侨农场'],
            '东方': ['八所镇', '东河镇', '大田镇', '感城镇', '板桥镇', '三家镇', '四更镇', '新龙镇', '天安乡', '江边乡'],
            '定安': ['定城镇', '新竹镇', '龙湖镇', '黄竹镇', '雷鸣镇', '龙门镇', '龙河镇', '岭口镇', '翰林镇', '富文镇'],
            '屯昌': ['屯城镇', '新兴镇', '枫木镇', '乌坡镇', '南吕镇', '坡心镇', '南坤镇', '西昌镇'],
            '澄迈': ['金江镇', '老城镇', '瑞溪镇', '永发镇', '加乐镇', '文儒镇', '中兴镇', '仁兴镇', '福山镇', '桥头镇', '大丰镇'],
            '临高': ['临城镇', '波莲镇', '东英镇', '博厚镇', '皇桐镇', '多文镇', '和舍镇', '南宝镇', '调楼镇', '新盈镇', '加来农场'],
            '白沙': ['牙叉镇', '七坊镇', '邦溪镇', '打安镇', '细水乡', '元门乡', '南开乡', '阜龙乡', '青松乡', '金波乡', '荣邦乡'],
            '昌江': ['石碌镇', '叉河镇', '十月田镇', '乌烈镇', '昌化镇', '海尾镇', '七叉镇', '王下乡'],
            '乐东': ['抱由镇', '万冲镇', '大安镇', '志仲镇', '千家镇', '九所镇', '利国镇', '黄流镇', '佛罗镇', '尖峰镇', '莺歌海镇'],
            '陵水': ['椰林镇', '光坡镇', '三才镇', '英州镇', '隆广镇', '文罗镇', '本号镇', '新村镇', '黎安镇', '提蒙乡', '群英乡'],
            '保亭': ['保城镇', '什玲镇', '加茂镇', '响水镇', '新政镇', '三道镇', '六弓乡', '南林乡', '毛感乡'],
            '琼中': ['营根镇', '湾岭镇', '黎母山镇', '和平镇', '长征镇', '红毛镇', '中平镇', '吊罗山乡', '上安乡', '什运乡'],
            '南宁': ['兴宁区', '青秀区', '江南区', '西乡塘区', '良庆区', '邕宁区', '武鸣区', '隆安县', '马山县', '上林县', '宾阳县', '横县'],
            '柳州': ['城中区', '鱼峰区', '柳南区', '柳北区', '柳江区', '柳城县', '鹿寨县', '融安县', '融水县', '三江县'],
            '桂林': ['秀峰区', '叠彩区', '象山区', '七星区', '雁山区', '临桂区', '阳朔县', '灵川县', '全州县', '兴安县', '永福县', '灌阳县', '龙胜县', '资源县', '平乐县', '荔浦县', '恭城县'],
            '梧州': ['万秀区', '龙圩区', '长洲区', '苍梧县', '藤县', '蒙山县', '岑溪市'],
            '北海': ['海城区', '银海区', '铁山港区', '合浦县'],
            '防城港': ['港口区', '防城区', '上思县', '东兴市'],
            '钦州': ['钦南区', '钦北区', '灵山县', '浦北区'],
            '贵港': ['港北区', '港南区', '覃塘区', '平南县', '桂平市'],
            '玉林': ['玉州区', '容县', '陆川县', '博白县', '兴业县', '北流市'],
            '百色': ['右江区', '田阳县', '田东县', '平果县', '德保县', '靖西市', '那坡县', '凌云县', '乐业县', '田林县', '西林县', '隆林县'],
            '贺州': ['八步区', '平桂区', '昭平县', '钟山县', '富川县'],
            '河池': ['金城江区', '宜州区', '南丹县', '天蛾县', '凤山县', '东兰县', '罗城县', '环江县', '巴马县', '都安县', '大化县'],
            '来宾': ['兴宾区', '忻城县', '象州县', '武宣县', '金秀县', '合山市'],
            '崇左': ['江州区', '扶绥县', '宁明县', '龙州县', '大新县', '天等县', '凭祥市'],
            '广州': ['荔湾区', '越秀区', '海珠区', '天河区', '白云区', '黄埔区', '番禺区', '花都区', '南沙区', '从化区', '增城区'],
            '韶关': ['武江区', '浈江区', '曲江区', '始兴县', '仁化县', '翁源县', '乳源县', '新丰县', '乐昌市', '南雄市'],
            '深圳': ['罗湖区', '福田区', '南山区', '宝安区', '龙岗区', '盐田区', '龙华区', '坪山区', '光明区'],
            '珠海': ['香洲区', '斗门区', '金湾区'],
            '汕头': ['龙湖区', '金平区', '濠江区', '潮阳区', '潮南区', '澄海区', '南澳县'],
            '佛山': ['禅城区', '南海区', '顺德区', '三水区', '高明区'],
            '江门': ['蓬江区', '江海区', '新会区', '台山市', '开平市', '鹤山市', '恩平市'],
            '湛江': ['赤坎区', '霞山区', '坡头区', '麻章区', '遂溪县', '徐闻县', '廉江市', '雷州市', '吴川市'],
            '茂名': ['茂南区', '电白区', '高州市', '化州市', '信宜市'],
            '肇庆': ['端州区', '鼎湖区', '高要区', '广宁县', '怀集县', '封开县', '德庆县', '四会市'],
            '惠州': ['惠城区', '惠阳区', '博罗县', '惠东县', '龙门县'],
            '梅州': ['梅江区', '梅县区', '大埔县', '丰顺县', '五华县', '平远县', '蕉岭县', '兴宁市'],
            '汕尾': [ '海丰县', '陆河县', '陆丰市'],
            '河源': ['源城区', '紫金县', '龙川县', '连平县', '和平县', '东源县'],
            '阳江': ['江城区', '阳东区', '阳西县', '阳春市'],
            '清远': ['清城区', '清新区', '佛冈县', '阳山县', '连山县', '连南县', '英德市', '连州市'],
            '东莞': ['东城街道', '南城街道', '万江街道', '莞城街道', '石碣镇', '石龙镇', '茶山镇', '石排镇', '企石镇', '横沥镇', '桥头镇', '谢岗镇', '东坑镇', '常平镇', '寮步镇', '樟木头镇', '大朗镇', '黄江镇', '清溪镇', '塘厦镇', '凤岗镇', '大岭山镇', '长安镇', '虎门镇', '厚街镇', '沙田镇', '道�蛘�', '洪梅镇', '麻涌镇', '望牛墩镇', '中堂镇', '高�墩�'],
            '中山': ['石岐区街道', '东区街道', '火炬开发区街道', '西区街道', '南区街道', '五桂山街道', '小榄镇', '黄圃镇', '民众镇', '东凤镇', '东升镇', '古镇镇', '沙溪镇', '坦洲镇', '港口镇', '三角镇', '横栏镇', '南头镇', '阜沙镇', '南朗镇', '三乡镇', '板芙镇', '大涌镇', '神湾镇'],
            '潮州': ['湘桥区', '潮安区', '饶平县'],
            '揭阳': ['榕城区', '揭东区', '揭西县', '惠来县', '普宁市'],
            '云浮': ['云城区', '云安区', '新兴县', '郁南县', '罗定市'],
            '长沙': ['芙蓉区', '天心区', '岳麓区', '开福区', '雨花区', '望城区', '长沙县', '浏阳市', '宁乡市'],
            '株洲': ['荷塘区', '芦淞区', '石峰区', '天元区', '株洲县', '攸县', '茶陵县', '炎陵县', '云龙示范区', '醴陵市'],
            '湘潭': ['雨湖区', '岳塘区', '湘潭县', '高新技术产业园区', '昭山示范区', '九华示范区', '湘乡市', '韶山市'],
            '衡阳': ['珠晖区', '雁峰区', '石鼓区', '蒸湘区', '南岳区', '衡阳县', '衡南县', '衡山县', '衡东县', '祁东县', '衡阳综合保税区', '高新技术产业园区', '松木经济开发区', '耒阳市', '常宁市'],
            '邵阳': ['双清区', '大祥区', '北塔区', '邵东县', '新邵县', '邵阳县', '隆回县', '洞口县', '绥宁县', '新宁县', '城步苗族自治县', '武冈市'],
            '岳阳': ['岳阳楼区', '云溪区', '君山区', '岳阳县', '华容县', '湘阴县', '平江县', '屈原管理区', '汨罗市', '临湘市'],
            '常德': ['武陵区', '鼎城区', '安乡县', '汉寿县', '澧县', '临澧县', '桃源县', '石门县', '西洞庭管理区', '津市市'],
            '张家界': ['永定区', '武陵源区', '慈利县', '桑植县'],
            '益阳': ['资阳区', '赫山区', '南县', '桃江县', '安化县', '大通湖管理区', '高新技术产业园区', '沅江市'],
            '郴州': ['北湖区', '苏仙区', '桂阳县', '宜章县', '永兴县', '嘉禾县', '临武县', '汝城县', '桂东县', '安仁县', '资兴市'],
            '永州': ['零陵区', '冷水滩区', '祁阳县', '东安县', '双牌县', '道县', '江永县', '宁远县', '蓝山县', '新田县', '江华县', '经济技术开发区', '金洞管理区', '回龙圩管理区'],
            '怀化': ['鹤城区', '中方县', '沅陵县', '辰溪县', '溆浦县', '会同县', '麻阳县', '新晃县', '芷江县', '靖州县', '通道县', '洪江管理区', '洪江市'],
            '娄底': ['娄星区', '双峰县', '新化县', '冷水江市', '涟源市'],
            '湘西自治州': ['吉首市', '泸溪县', '凤凰县', '花垣县', '保靖县', '古丈县', '永顺县', '龙山县'],
            '武汉': ['江岸区', '江汉区', '�~口区', '汉阳区', '武昌区', '青山区', '洪山区', '东西湖区', '汉南区', '蔡甸区', '江夏区', '黄陂区', '新洲区'],
            '黄石': ['黄石港区', '西塞山区', '下陆区', '铁山区', '阳新县', '大冶市'],
            '十堰': ['茅箭区', '张湾区', '郧阳区', '郧西县', '竹山县', '竹溪县', '房县', '丹江口市'],
            '宜昌': ['西陵区', '伍家岗区', '点军区', '�V亭区', '夷陵区', '远安县', '兴山县', '秭归县', '长阳县', '五峰县', '宜都市', '当阳市', '枝江市'],
            '襄阳': ['襄城区', '樊城区', '襄州区', '南漳县', '谷城县', '保康县', '老河口市', '枣阳市', '宜城市'],
            '鄂州': ['梁子湖区', '华容区', '鄂城区'],
            '荆门': ['东宝区', '掇刀区', '京山市', '沙洋县', '钟祥市'],
            '孝感': ['孝南区', '孝昌县', '大悟县', '云梦县', '应城市', '安陆市', '汉川市'],
            '荆州': ['沙市区', '荆州区', '公安县', '监利县', '江陵县', '荆州经济技术开发区', '石首市', '洪湖市', '松滋市'],
            '黄冈': ['龙感湖管理区', '黄州区', '团风县', '红安县', '罗田县', '英山县', '浠水县', '蕲春县', '黄梅县', '麻城市', '武穴市'],
            '咸宁': ['咸安区', '嘉鱼县', '通城县', '崇阳县', '通山县', '赤壁市'],
            '随州': ['曾都区', '随县', '广水市'],
            '恩施': ['恩施市', '利川市', '建始县', '巴东县', '宣恩县', '咸丰县', '来凤县', '鹤峰县'],
            '仙桃': ['沙嘴街道', '干河街道', '龙华山街道', '郑场镇', '毛嘴镇', '三伏潭镇', '胡场镇', '长�每谡�', '西流河镇', '沙湖镇', '杨林尾镇', '彭场镇', '张沟镇', '郭河镇', '沔城镇', '通海口镇', '陈场镇', '工业园区', '沙湖原种场', '排湖风景区', '五湖渔场'],
            '潜江': ['园林街道', '杨市街道', '周矶街道', '广华街道', '泰丰办事处', '高场办事处', '竹根滩镇', '渔洋镇', '王场镇', '高石碑镇', '熊口镇', '老新镇', '浩口镇', '积玉口镇', '张金镇', '龙湾镇', '江汉石油管理局', '潜江经济开发区', '周矶管理区', '后湖管理区', '熊口管理区', '总口管理区', '白鹭湖管理区', '运粮湖管理区'],
            '天门': ['竟陵街道', '侨乡街道', '杨林街道', '多宝镇', '拖市镇', '张港镇', '蒋场镇', '汪场镇', '渔薪镇', '黄潭镇', '岳口镇', '横林镇', '彭市镇', '麻洋镇', '多祥镇', '干驿镇', '马湾镇', '卢市镇', '小板镇', '九真镇', '皂市镇', '胡市镇', '石河镇', '佛子山镇', '净潭乡', '蒋湖农场', '白茅湖农场'],
            '神农架林': ['松柏镇', '阳日镇', '木鱼镇', '红坪镇', '新华镇', '九湖镇', '宋洛乡', '下谷坪土家族乡'],
            '郑州': ['中原区', '二七区', '管城回族区', '金水区', '上街区', '惠济区', '中牟县', '巩义市', '荥阳市', '新密市', '新郑市', '登封市'],
            '开封': ['龙亭区', '顺河回族区', '鼓楼区', '禹王台区', '祥符区', '杞县', '通许县', '尉氏县', '兰考县'],
            '洛阳': ['老城区', '西工区', '涧西区', '吉利区', '洛龙区', '孟津县', '新安县', '栾川县', '嵩县', '汝阳县', '宜阳县', '洛宁县', '伊川县', '偃师市'],
            '平顶山': ['新华区', '卫东区', '石龙区', '湛河区', '宝丰县', '叶县', '鲁山县', '郏县', '舞钢市', '汝州市'],
            '安阳': ['文峰区', '北关区', '殷都区', '龙安区', '安阳县', '汤阴县', '滑县', '内黄县', '林州市'],
            '鹤壁': ['鹤山区', '山城区', '淇滨区', '浚县', '淇县'],
            '新乡': ['红旗区', '卫滨区', '凤泉区', '牧野区', '新乡县', '获嘉县', '原阳县', '延津县', '封丘县', '长垣县', '卫辉市', '辉县市'],
            '焦作': ['解放区', '中站区', '马村区', '山阳区', '修武县', '博爱县', '武陟县', '温县', '沁阳市', '孟州市'],
            '濮阳': ['华龙区', '清丰县', '南乐县', '范县', '台前县', '濮阳县'],
            '许昌': ['魏都区', '建安区', '鄢陵县', '襄城县', '禹州市', '长葛市'],
            '漯河': ['经济技术开发区', '源汇区', '郾城区', '召陵区', '舞阳县', '临颍县'],
            '三门峡': ['湖滨区', '渑池县', '陕州区', '卢氏县', '义马市', '灵宝市'],
            '南阳': ['宛城区', '卧龙区', '南召县', '方城县', '西峡县', '镇平县', '内乡县', '淅川县', '社旗县', '唐河县', '新野县', '桐柏县', '邓州市'],
            '商丘': ['梁园区', '睢阳区', '民权县', '睢县', '宁陵县', '柘城县', '虞城县', '夏邑县', '永城市'],
            '信阳': [ '平桥区', '罗山县', '光山县', '新县', '商城县', '固始县', '潢川县', '淮滨县', '息县'],
            '周口': ['川汇区', '扶沟县', '西华县', '商水县', '沈丘县', '郸城县', '淮阳县', '太康县', '鹿邑县', '项城市'],
            '驻马店': ['驿城区', '西平县', '上蔡县', '平舆县', '正阳县', '确山县', '泌阳县', '汝南县', '遂平县', '新蔡县'],
            '济源': ['沁园街道', '济水街道', '北海街道', '天坛街道', '玉泉街道', '克井镇', '五龙口镇', '轵城镇', '承留镇', '邵原镇', '坡头镇', '梨林镇', '大峪镇', '思礼镇', '王屋镇', '下冶镇'],
            '济南': ['历下区', '市中区', '槐荫区', '天桥区', '历城区', '长清区', '章丘区', '平阴县', '济阳区', '商河县', '莱芜区', '钢城区'],
            '青岛': ['市南区', '市北区', '黄岛区', '崂山区', '李沧区', '城阳区', '胶州市', '即墨区', '平度市', '莱西市'],
            '淄博': ['淄川区', '张店区', '博山区', '临淄区', '周村区', '桓台县', '高青县', '沂源县'],
            '枣庄': ['市中区', '薛城区', '峄城区', '台儿庄区', '山亭区', '滕州市'],
            '东营': ['东营区', '河口区', '垦利区', '利津县', '广饶县'],
            '烟台': ['芝罘区', '福山区', '牟平区', '莱山区', '长岛县', '龙口市', '莱阳市', '莱州市', '蓬莱市', '招远市', '栖霞市', '海阳市'],
            '潍坊': ['潍城区', '寒亭区', '坊子区', '奎文区', '临朐县', '昌乐县', '青州市', '诸城市', '寿光市', '安丘市', '高密市', '昌邑市'],
            '济宁': ['任城区', '兖州区', '微山县', '鱼台县', '金乡县', '嘉祥县', '汶上县', '泗水县', '梁山县', '曲阜市', '邹城市'],
            '泰安': ['泰山区', '岱岳区', '宁阳县', '东平县', '新泰市', '肥城市'],
            '威海': ['环翠区', '文登区', '荣成市', '乳山市'],
            '日照': ['东港区', '岚山区', '五莲县', '莒县'],
            '临沂': ['兰山区', '罗庄区', '河东区', '沂南县', '郯城县', '沂水县', '兰陵县', '费县', '平邑县', '莒南县', '蒙阴县', '临沭县'],
            '德州': ['德城区', '陵城区', '宁津县', '庆云县', '临邑县', '齐河县', '平原县', '夏津县', '武城县', '乐陵市', '禹城市'],
            '聊城': ['东昌府区', '阳谷县', '莘县', '茌平县', '东阿县', '冠县', '高唐县', '临清市'],
            '滨州': ['高新技术产业开发区', '经济开发区', '滨城区', '沾化区', '惠民县', '阳信县', '无棣县', '博兴县', '邹平市'],
            '菏泽': ['牡丹区', '定陶区', '曹县', '单县', '成武县', '巨野县', '郓城县', '鄄城县', '东明县'],
            '南昌': ['东湖区', '西湖区', '青云谱区', '湾里区', '青山湖区', '南昌县', '新建区', '安义县', '进贤县'],
            '景德镇': ['昌江区', '珠山区', '浮梁县', '乐平市'],
            '萍乡': ['安源区', '湘东区', '莲花县', '上栗县', '芦溪县'],
            '九江': ['濂溪区', '浔阳区', '柴桑区', '武宁县', '修水县', '永修县', '德安县', '庐山市', '都昌县', '湖口县', '彭泽县', '瑞昌市', '共青城市'],
            '新余': ['渝水区', '分宜县'],
            '鹰潭': ['月湖区', '余江区', '贵溪市'],
            '赣州': ['章贡区', '赣县区', '信丰县', '大余县', '上犹县', '崇义县', '安远县', '龙南县', '定南县', '全南县', '宁都县', '于都县', '兴国县', '会昌县', '寻乌县', '石城县', '瑞金市', '南康区'],
            '吉安': ['吉州区', '青原区', '吉安县', '吉水县', '峡江县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县', '井冈山市'],
            '宜春': ['袁州区', '奉新县', '万载县', '上高县', '宜丰县', '靖安县', '铜鼓县', '丰城市', '樟树市', '高安市'],
            '抚州': ['临川区', '东乡区', '南城县', '黎川县', '南丰县', '崇仁县', '乐安县', '宜黄县', '金溪县', '资溪县', '广昌县'],
            '上饶': ['信州区', '上饶县', '广丰区', '玉山县', '铅山县', '横峰县', '弋阳县', '余干县', '鄱阳县', '万年县', '婺源县', '德兴市'],
            '福州': ['鼓楼区', '台江区', '仓山区', '马尾区', '晋安区', '长乐区', '闽侯县', '连江县', '罗源县', '闽清县', '永泰县', '平潭县', '福清市'],
            '厦门': ['思明区', '海沧区', '湖里区', '集美区', '同安区', '翔安区'],
            '莆田': ['城厢区', '涵江区', '荔城区', '秀屿区', '仙游县'],
            '三明': ['梅列区', '三元区', '明溪县', '清流县', '宁化县', '大田县', '尤溪县', '沙县', '将乐县', '泰宁县', '建宁县', '永安市'],
            '泉州': ['鲤城区', '丰泽区', '洛江区', '泉港区', '惠安县', '安溪县', '永春县', '德化县', '金门县', '石狮市', '晋江市', '南安市'],
            '漳州': ['芗城区', '龙文区', '云霄县', '漳浦县', '诏安县', '长泰县', '东山县', '南靖县', '平和县', '华安县', '龙海市'],
            '南平': ['延平区', '建阳区', '顺昌县', '浦城县', '光泽县', '松溪县', '政和县', '邵武市', '武夷山市', '建瓯市'],
            '龙岩': ['新罗区', '永定区', '长汀县', '上杭县', '武平县', '连城县', '漳平市'],
            '宁德': ['蕉城区', '霞浦县', '古田县', '屏南县', '寿宁县', '周宁县', '柘荣县', '福安市', '福鼎市'],
            '合肥': ['瑶海区', '庐阳区', '蜀山区', '包河区', '长丰县', '肥东县', '肥西县', '庐江县', '巢湖市'],
            '芜湖': ['镜湖区', '弋江区', '鸠江区', '三山区', '芜湖县', '繁昌县', '南陵县', '无为县'],
            '蚌埠': ['龙子湖区', '蚌山区', '禹会区', '淮上区', '怀远县', '五河县', '固镇县'],
            '淮南': ['大通区', '田家庵区', '谢家集区', '八公山区', '潘集区', '凤台县', '寿县'],
            '马鞍山': ['博望区', '花山区', '雨山区', '当涂县', '含山县', '和县'],
            '淮北': ['杜集区', '相山区', '烈山区', '濉溪县'],
            '铜陵': ['铜官区', '义安区',  '枞阳县'],
            '安庆': ['迎江区', '大观区', '宜秀区', '怀宁县', '潜山市', '太湖县', '宿松县', '望江县', '岳西县', '桐城市'],
            '黄山': ['屯溪区', '黄山区', '徽州区', '歙县', '休宁县', '黟县', '祁门县'],
            '滁州': ['琅琊区', '南谯区', '来安县', '全椒县', '定远县', '凤阳县', '天长市', '明光市'],
            '阜阳': ['颍州区', '颍东区', '颍泉区', '临泉县', '太和县', '阜南县', '颍上县', '界首市'],
            '宿州': ['砀山县', '萧县', '灵璧县', '泗县'],
            '六安': ['金安区', '裕安区', '叶集区', '霍邱县', '舒城县', '金寨县', '霍山县'],
            '亳州': ['谯城区', '涡阳县', '蒙城县', '利辛县'],
            '池州': ['贵池区', '东至县', '石台县', '青阳县'],
            '宣城': ['宣州区', '郎溪县', '广德县', '泾县', '绩溪县', '旌德县', '宁国市'],
            '杭州': ['上城区', '下城区', '江干区', '拱墅区', '西湖区', '滨江区', '萧山区', '余杭区', '富阳区', '临安区', '桐庐县', '淳安县', '建德市'],
            '宁波': ['海曙区', '江北区', '北仑区', '镇海区', '鄞州区', '奉化区', '象山县', '宁海县', '余姚市', '慈溪市'],
            '温州': ['鹿城区', '龙湾区', '瓯海区', '洞头区', '永嘉县', '平阳县', '苍南县', '文成县', '泰顺县', '瑞安市', '乐清市'],
            '嘉兴': ['南湖区', '秀洲区', '嘉善县', '海盐县', '海宁市', '平湖市', '桐乡市'],
            '湖州': ['吴兴区', '南浔区', '德清县', '长兴县', '安吉县'],
            '绍兴': ['越城区', '柯桥区', '新昌县', '诸暨市', '上虞区', '嵊州市'],
            '金华': ['婺城区', '金东区', '武义县', '浦江县', '磐安县', '兰溪市', '义乌市', '东阳市', '永康市'],
            '衢州': ['柯城区', '衢江区', '常山县', '开化县', '龙游县', '江山市'],
            '舟山': ['定海区', '普陀区', '岱山县', '嵊泗县'],
            '台州': ['椒江区', '黄岩区', '路桥区', '玉环市', '三门县', '天台县', '仙居县', '温岭市', '临海市'],
            '丽水': ['莲都区', '青田县', '缙云县', '遂昌县', '松阳县', '云和县', '庆元县', '景宁县', '龙泉市'],
            '南京': ['玄武区', '秦淮区', '建邺区', '鼓楼区', '浦口区', '栖霞区', '雨花台区', '江宁区', '六合区', '溧水区', '高淳区'],
            '无锡': ['锡山区', '惠山区', '滨湖区', '梁溪区', '新吴区', '江阴市', '宜兴市'],
            '徐州': ['鼓楼区', '云龙区', '贾汪区', '泉山区', '铜山区', '丰县', '沛县', '睢宁县', '新沂市', '邳州市'],
            '常州': ['天宁区', '钟楼区', '新北区', '武进区', '溧阳市', '金坛区'],
            '苏州': ['虎丘区', '吴中区', '相城区', '姑苏区', '吴江区', '常熟市', '张家港市', '昆山市', '太仓市'],
            '南通': ['崇川区', '港闸区', '通州区', '海安市', '如东市', '启东市', '如皋市', '海门市'],
            '连云港': ['连云区', '海州区', '赣榆区', '东海县', '灌云县', '灌南县'],
            '淮安': ['淮安区', '淮阴区', '清江浦区', '涟水县', '洪泽区', '盱眙县', '金湖县'],
            '盐城': ['亭湖区', '盐都区', '大丰区', '响水县', '滨海县', '阜宁县', '射阳县', '建湖县', '东台市'],
            '扬州': ['广陵区', '邗江区', '江都区', '宝应县', '仪征市', '高邮市'],
            '镇江': ['京口区', '润州区', '丹徒区', '丹阳市', '扬中市', '句容市'],
            '泰州': ['海陵区', '高港区', '兴化市', '靖江市', '泰兴市', '姜堰区'],
            '宿迁': ['宿城区', '宿豫区', '沭阳县', '泗阳县', '泗洪县'],
            '哈尔滨': ['道里区', '南岗区', '道外区', '平房区', '松北区', '香坊区', '呼兰区', '阿城区', '双城区', '依兰县', '方正县', '宾县', '巴彦县', '木兰县', '通河县', '延寿县', '尚志市', '五常市'],
            '齐齐哈尔': ['龙沙区', '建华区', '铁锋区', '昂昂溪区', '富拉尔基区', '碾子山区', '梅里斯达斡尔族区', '龙江县', '依安县', '泰来县', '甘南县', '富裕县', '克山县', '克东县', '拜泉县', '讷河市'],
            '鸡西': ['鸡冠区', '恒山市', '滴道区', '梨树区', '城子河区', '麻山区', '鸡东县', '虎林市', '密山市'],
            '鹤岗': ['向阳区', '工农区', '南山区', '兴安区', '东山区', '兴山区', '萝北县', '绥滨县'],
            '双鸭山': ['尖山区', '岭东区', '四方台区', '宝山区', '集贤县', '友谊县', '宝清县', '饶河县'],
            '大庆': ['萨尔图区', '龙凤区', '让胡路区', '红岗区', '大同区', '肇州县', '肇源县', '林甸县', '杜尔伯特蒙县'],
            '伊春': ['伊春区', '南岔区', '友好区', '西林区', '翠峦区', '新青区', '美溪区', '金山屯', '五营区', '乌马河', '汤旺河', '带岭区', '乌伊岭', '红星区', '上甘岭', '嘉荫县', '铁力市'],
            '佳木斯': ['向阳区', '前进区', '东风区',  '桦南县', '桦川县', '汤原县', '抚远市', '同江市', '富锦市'],
            '七台河': ['新兴区', '桃山市', '茄子河区', '勃利县'],
            '牡丹江': ['东安区', '阳明区', '爱民区', '西安区', '林口县', '绥芬河市', '海林市', '宁安市', '穆棱市', '东宁市'],
            '黑河': ['爱辉区', '嫩江县', '逊克县', '孙吴县', '北安市', '五大连池市'],
            '绥化': ['北林区', '望奎县', '兰西县', '青冈县', '庆安县', '明水县', '绥棱县', '安达市', '肇东市', '海伦市'],
            '大兴安岭': ['加格达奇区', '松岭区', '新林区', '呼中区', '呼玛县', '塔河县', '漠河市'],
            '长春': ['南关区', '宽城区', '朝阳区', '二道区', '绿园区', '双阳区', '九台区', '农安县', '榆树市', '德惠市'],
            '吉林': ['昌邑区', '龙潭区', '船营区', '丰满区', '永吉县', '蛟河市', '桦甸市', '舒兰市', '磐石市'],
            '四平': ['铁西区', '铁东区', '梨树县', '伊通满族自治县', '公主岭市', '双辽市'],
            '辽源': ['龙山区', '西安区', '东丰县', '东辽县'],
            '通化': ['东昌区', '二道江区', '通化县', '辉南县', '柳河县', '梅河口市', '集安市'],
            '白山': ['浑江区', '江源区', '抚松县', '靖宇县', '长白县', '临江市'],
            '松原': ['宁江区', '前郭尔罗斯县', '长岭县', '乾安县', '扶余市'],
            '白城': ['洮北区', '镇赉县', '通榆县', '洮南市', '大安市'],
            '延边自治州': ['延吉市', '图们市', '敦化市', '珲春市', '龙井市', '和龙市', '汪清县', '安图县'],
            '沈阳': ['和平区', '沈河区', '大东区', '皇姑区', '铁西区', '苏家屯区', '浑南区', '沈北新区', '于洪区', '辽中区', '康平县', '法库县', '新民市'],
            '大连': ['中山区', '西岗区', '沙河口区', '甘井子区', '旅顺口区', '金州区', '普兰店区', '长海县', '瓦房店市', '庄河市'],
            '鞍山': ['铁东区', '铁西区', '立山区', '千山区', '台安县', '岫岩满族自治县', '海城市'],
            '抚顺': ['新抚区', '东洲区', '望花区', '顺城区', '抚顺县', '新宾满族自治县', '清原满族自治县'],
            '本溪': ['平山区', '溪湖区', '明山区', '南芬区', '本溪满族自治县', '桓仁满族自治县'],
            '丹东': ['元宝区', '振兴区', '振安区', '宽甸满族自治县', '东港市', '凤城市'],
            '锦州': ['古塔区', '凌河区', '太和区', '黑山县', '义县', '凌海市', '北镇市'],
            '营口': ['站前区', '西市区', '鲅鱼圈区', '老边区', '盖州市', '大石桥市'],
            '阜新': ['海州区', '新邱区', '太平区', '清河门区', '细河区', '阜新蒙古族自治县', '彰武县'],
            '辽阳': ['白塔区', '文圣区', '宏伟区', '弓长岭区', '太子河区', '辽阳县', '灯塔市'],
            '盘锦': ['双台子区', '兴隆台区', '大洼区', '盘山县'],
            '铁岭': ['银州区', '清河区', '铁岭县', '西丰县', '昌图县', '调兵山市', '开原市'],
            '朝阳': ['双塔区', '龙城区', '朝阳县', '建平县', '喀左县', '北票市', '凌源市'],
            '葫芦岛': ['连山区', '龙港区', '南票区', '绥中县', '建昌县', '兴城市'],
            '呼和浩特': ['新城区', '回民区', '玉泉区', '赛罕区', '土默特左旗', '托克托县', '和林格尔县', '清水河县', '武川县'],
            '包头': ['东河区', '昆都仑区', '青山区', '石拐区', '白云鄂博矿区', '九原区', '土默特右旗', '固阳县', '达尔罕旗'],
            '乌海': ['海勃湾区', '海南区', '乌达区'],
            '赤峰': ['红山区', '元宝山区', '松山区', '阿鲁旗', '巴林左旗', '巴林右旗', '林西县', '克什克腾旗', '翁牛特旗', '喀喇沁旗', '宁城县', '敖汉旗'],
            '通辽': ['科尔沁区', '科尔沁左翼中旗', '科尔沁左翼后旗', '开鲁县', '库伦旗', '奈曼旗', '扎鲁特旗', '霍林郭勒市'],
            '鄂尔多斯': ['东胜区', '康巴什区', '达拉特旗', '准格尔旗', '鄂托克前旗', '鄂托克旗', '杭锦旗', '乌审旗', '伊金霍洛旗'],
            '呼伦贝尔': ['扎赉诺尔区', '海拉尔区', '阿荣旗', '莫力达瓦旗', '鄂伦春自治旗', '鄂温克族自治旗', '陈巴尔虎旗', '新巴尔虎左旗', '新巴尔虎右旗', '满洲里', '牙克石市', '扎兰屯市', '额尔古纳市', '根河市'],
            '巴彦淖尔': ['临河区', '五原县', '磴口县', '乌拉特前旗', '乌拉特中旗', '乌拉特后旗', '杭锦后旗'],
            '乌兰察布': ['集宁区', '卓资县', '化德县', '商都县', '兴和县', '凉城县', '察哈尔右翼前旗', '察哈尔右翼中旗', '察哈尔右翼后旗', '四子王旗', '丰镇市'],
            '兴安盟': ['乌兰浩特市', '阿尔山市', '科尔沁右翼前旗', '科尔沁右翼中旗', '扎赉特旗', '突泉县'],
            '锡林郭勒盟': ['二连浩特市', '锡林浩特市', '阿巴嘎旗', '苏尼特左旗', '苏尼特右旗', '东乌珠穆沁旗', '西乌珠穆沁', '太仆寺旗', '镶黄旗', '正镶白旗', '正蓝旗', '多伦县'],
            '阿拉善盟': ['阿拉善左旗', '阿拉善右旗', '额济纳旗'],
            '太原': ['小店区', '迎泽区', '杏花岭区', '尖草坪区', '万柏林区', '晋源区', '清徐县', '阳曲县', '娄烦县', '古交市'],
            '大同': ['平城区', '云冈区', '新荣区', '云州区', '阳高县', '天镇县', '广灵县', '灵丘县', '浑源县', '左云县'],
            '阳泉': [  '平定县', '盂县'],
            '长治': [  '长治县', '襄垣县', '屯留县', '平顺县', '黎城县', '壶关县', '长子县', '武乡县', '沁县', '沁源县', '潞城市'],
            '晋城': [ '沁水县', '阳城县', '陵川县', '泽州县', '高平市'],
            '朔州': ['朔城区', '平鲁区', '山阴县', '应县', '右玉县', '怀仁市'],
            '晋中': ['榆次区', '榆社县', '左权县', '和顺县', '昔阳县', '寿阳县', '太谷县', '祁县', '平遥县', '灵石县', '介休市'],
            '运城': ['盐湖区', '临猗县', '万荣县', '闻喜县', '稷山县', '新绛县', '绛县', '垣曲县', '夏县', '平陆县', '芮城县', '永济市', '河津市'],
            '忻州': ['忻府区', '定襄县', '五台县', '代县', '繁峙县', '宁武县', '静乐县', '神池县', '五寨县', '岢岚县', '河曲县', '保德县', '偏关县', '原平市'],
            '临汾': ['尧都区', '曲沃县', '翼城县', '襄汾县', '洪洞县', '古县', '安泽县', '浮山县', '吉县', '乡宁县', '大宁县', '隰县', '永和县', '蒲县', '汾西县', '侯马市', '霍州市'],
            '吕梁': ['离石区', '文水县', '交城县', '兴县', '临县', '柳林县', '石楼县', '岚县', '方山县', '中阳县', '交口县', '孝义市', '汾阳市'],
            '石家庄': ['长安区', '桥西区', '新华区', '井陉矿区', '裕华区', '藁城区', '鹿泉区', '栾城区', '井陉县', '正定县', '行唐县', '灵寿县', '高邑县', '深泽县', '赞皇县', '无极县', '平山县', '元氏县', '赵县', '辛集市', '晋州市', '新乐市'],
            '唐山': ['路南区', '路北区', '古冶区', '开平区', '丰南区', '丰润区', '滦州市', '滦南县', '乐亭县', '迁西县', '玉田县', '曹妃甸区', '遵化市', '迁安市'],
            '秦皇岛': ['海港区', '山海关区', '北戴河区', '青龙县', '昌黎县', '抚宁区', '卢龙县'],
            '邯郸': ['邯山区', '丛台区', '复兴区', '峰峰矿区', '肥乡区', '永年区', '临漳县', '成安县', '大名县', '涉县', '磁县', '邱县', '鸡泽县', '广平县', '馆陶县', '魏县', '曲周县', '武安市'],
            '邢台': ['桥东区', '桥西区', '邢台县', '临城县', '内丘县', '柏乡县', '隆尧县', '任县', '南和县', '宁晋县', '巨鹿县', '新河县', '广宗县', '平乡县', '威县', '清河县', '临西县', '南宫市', '沙河市'],
            '保定': ['竞秀区', '莲池区', '满城区', '清苑区', '涞水县', '阜平县', '徐水区', '定兴县', '唐县', '高阳县', '涞源县', '望都县', '易县', '曲阳县', '蠡县', '顺平县', '博野县', '涿州市', '定州市', '安国市', '高碑店市'],
            '张家口': ['桥东区', '桥西区', '宣化区', '下花园区', '万全区', '崇礼区', '张北县', '康保县', '沽源县', '尚义县', '蔚县', '阳原县', '怀安县', '怀来县', '涿鹿县', '赤城县'],
            '承德': ['双桥区', '双滦区', '鹰手营子矿区', '承德县', '兴隆县', '平泉市', '滦平县', '隆化县', '丰宁满族自治县', '宽城县', '围场县'],
            '沧州': ['新华区', '运河区', '沧县', '青县', '东光县', '海兴县', '盐山县', '肃宁县', '南皮县', '吴桥县', '献县', '孟村回族自治县', '泊头市', '任丘市', '黄骅市', '河间市'],
            '廊坊': ['安次区', '广阳区', '固安县', '永清县', '香河县', '大城县', '文安县', '大厂回族自治县', '霸州市', '三河市'],
            '衡水': ['桃城区', '冀州市', '枣强县', '武邑县', '武强县', '饶阳县', '安平县', '故城县', '景县', '阜城县', '深州市'],
            '巢湖': [],
            '北京': [],
            '上海': [],
            '天津': [],
            '重庆': [],
            '常熟': [],
            '瑞安': [],
            '嵊州': [],
            '上虞': [],
            '湘西': [],
            '兴义': [],
            '凯里': [],
            '都匀': [],
            '西双': [],
            '中甸': [],
            '思茅': [],
            '楚雄': [],
            '大理': [],
            '德宏': [],
            '香港': [],
            '新竹': [],
            '澳门': []}

    def return_num(self):
        """返回省和城市的编号"""
        # 处理数据
        self.province = str(self.province)
        if "省" in self.province:
            self.province = self.province.replace("省", "")
        if "自治区" in self.province:
            self.province = self.province[0] + self.province[1]
        self.city = str(self.city)
        if "市" in self.city:
            self.city = self.city.replace("市", "")
        self.xian = str(self.xian)

        # 两个都不是none的情况
        if self.province != "None" and self.city != "None":
            province_num = self.return_province_num(self.province)
            city_num = self.return_city_num(self.city)
            return [province_num, city_num]
        # 仅仅有省
        elif self.province != "None" and self.city == "None":
            province_num = self.return_province_num(self.province)
            return [province_num, None]
        # 只有城市
        elif self.province == "None" and self.city != "None":
            province_name = self.only_city(self.city)
            province_num = self.return_province_num(province_name)
            city_num = self.return_city_num(self.city)
            return [province_num, city_num]

        # 只有县
        elif self.province == "None" and self.city == "None" and self.xian != "None":
            # 有些无法识别就取前两个字看是否能在市的列表找到
            u = self.xian[0] + self.xian[1]
            for m in self.city_to_value.keys():
                if u in m:
                    province_name = self.only_city(m)
                    province_num = self.return_province_num(province_name)
                    city_num = self.return_city_num(m)
                    return [province_num, city_num]

            city_name = self.only_xian(self.xian)
            province_name = self.only_city(city_name)
            province_num = self.return_province_num(province_name)
            city_num = self.return_city_num(city_name)
            return [province_num, city_num]

    def only_city(self,city_name):
        """仅仅有城市"""
        for i in self.province_to_city.keys():
            city_list = self.province_to_city[i]
            for m in city_list:
                if m == city_name:
                    return i

    def only_xian(self,xian_name):
        """只有县"""
        print(xian_name)
        for i in self.city_to_xian.keys():
            xian_list = self.city_to_xian[i]
            for m in xian_list:
                if m == xian_name:
                    return i

    def return_province_num(self,province_name):
        """返回省的编号"""
        if province_name in self.province_to_value.keys():
            province_num = self.province_to_value[province_name]
        else:
            print("省不在已有列表")
            province_num = None
        return province_num

    def return_city_num(self,city_name):
        """返回城市的编号"""
        if city_name in self.city_to_value.keys():
            city_num = self.city_to_value[city_name]
        else:
            print("市不在已有列表")
            city_num = None
        return city_num


def province_list():
    lis = [
        "安徽", "北京", "广东",
        "上海", "天津", "重庆",
        "辽宁", "江苏", "湖北",
        "四川", "陕西", "河北",
        "山西", "河南", "吉林",
        "黑龙江", "内蒙古", "山东",
        "浙江", "福建", "湖南",
        "广西", "江西", "贵州",
        "云南", "西藏", "海南",
        "甘肃", "宁夏", "青海",
        "新疆", "香港", "台湾",
        "澳门"
    ]
    return lis


def city_list():
    lis = [
    '亳州', '池州', '巢湖',
    '六安', '宣城', '铜陵',
    '淮北', '黄山', '阜阳',
    '宿州', '安庆', '马鞍山',
    '淮南', '滁州', '蚌埠',
    '芜湖', '合肥','东莞',
    '潮州', '云浮', '清远',
    '河源', '中山', '湛江',
    '肇庆', '佛山', '珠海',
    '深圳', '汕头', '梅州',
    '惠州', '韶关', '江门',
    '茂名', '揭阳','阳江',
    '汕尾', '广州','葫芦岛',
    '盘锦', '朝阳', '辽阳',
    '阜新', '营口', '锦州',
    '丹东', '本溪', '抚顺',
    '鞍山', '大连', '铁岭',
    '沈阳','宿迁', '泰州',
    '常熟', '常州', '连云港',
    '淮安', '徐州', '盐城',
    '扬州', '南通', '苏州',
    '镇江', '无锡', '南京',
    '神农架林', '潜江', '天门',
    '仙桃', '荆门', '随州',
    '十堰', '恩施', '宜昌',
    '荆州', '咸宁', '黄石',
    '黄冈', '孝感', '鄂州',
    '襄阳', '武汉', '凉山州',
    '阿坝州', '眉山', '内江',
    '广元', '德阳', '甘孜州',
    '雅安', '乐山', '资阳',
    '宜宾', '泸州', '巴中',
    '广安', '遂宁', '达州',
    '南充', '绵阳', '自贡',
    '攀枝花', '成都', '铜川',
    '宝鸡', '汉中', '安康',
    '商洛', '渭南', '榆林',
    '延安', '咸阳', '西安',
    '秦皇岛', '邢台', '衡水',
    '沧州', '廊坊', '唐山',
    '承德', '张家口', '保定',
    '石家庄', '邯郸', '运城',
    '吕梁', '临汾', '晋城',
    '长治', '晋中', '阳泉',
    '大同', '太原', '忻州',
    '朔州', '济源', '三门峡',
    '驻马店', '漯河', '周口',
    '濮阳', '鹤壁', '焦作',
    '洛阳', '开封', '南阳',
    '信阳', '平顶山', '许昌',
    '新乡', '安阳', '郑州',
    '商丘', '白山', '松原',
    '辽源', '白城', '通化',
    '四平', '延边自治州', '吉林',
    '长春', '大兴安岭', '双鸭山',
    '鹤岗', '鸡西', '七台河',
    '大庆', '伊春', '黑河',
    '绥化', '佳木斯', '牡丹江',
    '齐齐哈尔', '哈尔滨', '乌海',
    '阿拉善盟', '兴安盟', '锡林郭勒盟',
    '巴彦淖尔', '鄂尔多斯', '赤峰',
    '通辽', '乌兰察布', '包头',
    '呼和浩特', '呼伦贝尔', '聊城',
    '日照', '枣庄', '威海',
    '东营', '滨州', '临沂',
    '泰安', '济宁', '潍坊',
    '烟台', '德州', '淄博',
    '青岛', '济南', '菏泽',
    '龙岩', '瑞安', '嵊州',
    '上虞', '舟山', '金华',
    '丽水', '温州', '台州',
    '绍兴', '宁波', '嘉兴',
    '湖州', '杭州', '衢州',
    '南平', '三明', '漳州',
    '泉州', '莆田', '宁德',
    '厦门', '福州', '湘西自治州',
    '永州', '怀化', '张家界',
    '湘西', '邵阳', '娄底',
    '益阳', '常德', '郴州',
    '衡阳', '株洲', '湘潭',
    '长沙', '岳阳', '崇左',
    '来宾', '贺州', '贵港',
    '北海', '河池', '钦州',
    '百色', '玉林', '梧州',
    '桂林', '柳州', '南宁',
    '防城港', '萍乡', '景德镇',
    '赣州', '吉安', '宜春',
    '抚州', '上饶', '九江',
    '南昌', '新余', '鹰潭',
    '黔南', '黔东', '黔西',
    '兴义', '六盘水', '毕节',
    '铜仁', '凯里', '都匀',
    '安顺', '遵义', '贵阳',
    '普洱市', '迪庆州', '怒江州',
    '德宏州', '大理州', '楚雄州',
    '西双', '红河州', '丽江',
    '中甸', '临沧', '思茅',
    '楚雄', '玉溪', '文山',
    '保山', '曲靖', '大理',
    '昆明', '昭通', '德宏',
    '西双版纳', '阿里', '那曲',
    '昌都', '林芝', '山南',
    '日喀则', '拉萨', '琼中',
    '保亭', '陵水', '乐东',
    '昌江', '白沙', '临高',
    '屯昌', '澄迈', '东方',
    '文昌', '琼海', '五指山',
    '万宁', '定安', '三亚',
    '海口', '儋州', '甘南州',
    '武威', '嘉峪关', '白银',
    '陇南', '天水', '酒泉',
    '张掖', '金昌', '庆阳',
    '平凉', '定西', '兰州',
    '临夏', '中卫', '固原',
    '吴忠', '石嘴山', '银川',
    '海西州', '玉树州', '果洛州',
    '海南州', '黄南州', '海北州',
    '海东', '西宁', '伊犁',
    '喀什', '阿克苏', '巴音郭楞',
    '吐鲁番', '昌吉州', '石河子',
    '乌鲁木齐', '克拉玛依', '博尔塔拉',
    '克孜勒苏', '阿勒泰', '和田',
    '哈密', '塔城','香港',
    '花莲', '新竹', '嘉义',
    '台南', '台中', '基隆',
    '高雄', '台北']
    return lis


def time_list():
    """时间列表"""
    time_list = [
        today_str,
        yesterday_str,
        # yesterday_1_str,
    ]
    return time_list


def get_img_src(ff):
    """将图片上传到后台然后获取图片的url"""
    num=0
    while True:
        num+=1
        if num>10:
            return None
        try:
            print("上传img")
            url="http://ad13in.gc-zb.com/static/admin/Tool/Editor4.1.10/php/upload_json.php?dir=image"
            file=[("imgFile",("下载.jpg",ff,"text/plain"))]
            a=requests.post(url, headers=headers, files=file, timeout=10)
            b=a.json()["url"]
            src=b.split("/..")[-1]
        except Exception as e:
            print(e)
            print("上传img again")
            time.sleep(1)
        else:
            print("上传图片成功")
            return src


def get_file_src(name,content):
    """将文件上传到后台然后获取文件的url"""
    num=0
    while True:
        num+=1
        if num>10:
            return None
        try:
            print("上传文件")
            url="http://ad13in.gc-zb.com/static/admin/Tool/Editor4.1.10/php/upload_json.php?dir=file"
            file=[("imgFile",(name,content,"text/plain"))]
            a=requests.post(url,headers=headers,files=file,
                            # cookies=cookies,
                            timeout=10)
            # print(a.json())
            b=a.json()["url"]
            src=b.split("/..")[-1]
        except Exception as e:
            print(e)
            print("上传file again")
            time.sleep(1)
        else:
            print("上传成功")
            return src


class Chaojiying_Client(object):
    def __init__(self):
        self.username = 18568534106   # 账号
        password = "1448334428q".encode('utf8')  # 密码
        self.password = md5(password).hexdigest()
        self.soft_id = 910508
        self.base_params = {
            'user': self.username,
            'pass2': self.password,
            'softid': self.soft_id,
        }
        self.headers = {
            'Connection': 'Keep-Alive',
            'User-Agent': 'Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)',
        }

    def PostPic(self, im, codetype):
        """
        im: 图片字节
        codetype: 题目类型 参考 http://www.chaojiying.com/price.html
        """
        params = {
            'codetype': codetype,
        }
        params.update(self.base_params)
        files = {'userfile': ('ccc.jpg', im)}
        r = requests.post('http://upload.chaojiying.net/Upload/Processing.php', data=params, files=files, headers=self.headers)
        return r.json()

    def ReportError(self, im_id):
        """
        im_id:报错题目的图片ID
        """
        params = {
            'id': im_id,
        }
        params.update(self.base_params)
        r = requests.post('http://upload.chaojiying.net/Upload/ReportError.php', data=params, headers=self.headers)
        return r.json()